[
  {
    "url":"https://satanasova.github.io/delivery-app-frontend/",
    "description":{
      "title":"Delivery App",
      "usedTech":["angular","sass","tailwind"],
      "descriptionText":"Delivery App is a responsive web application designed for efficient delivery management, featuring user authentication, chat functionality, customizable theme settings, interactive tables, along with a comprehensive dashboard equipped with an interactive map. The map allows users to click on offices to view detailed information such as package count and incoming/outgoing truck details, and also enables users to track individual truck routes for enhanced logistics visibility. Developed with Angular and Nebular UI Library, this application is designed to be scalable, visually appealing, and user-friendly."
    },
    "responsive": false
  },
  {
    "url":"https://satanasova.github.io/UD-final-task/",
    "description":{
      "title":"Rolso",
      "usedTech":["pug","sass","bootstrap","jquery","figma"],
      "descriptionText":"Rolso is an user-friendly responsive web application I developed during my internship program at Innovator, Varna. Leveraging the power of Pug, Sass, Bootstrap, and jQuery, the project features 16 thoughtfully crafted pages. Guided by a Figma design, Rolso delivers an engaging user experience with dynamic elements and visually appealing interfaces. It showcases my proficiency in web development, combining advanced technologies with a meticulous design approach to create a modern and functional application."
    }
  },
  {
    "url":"https://satanasova.github.io/photo-cutter/",
    "description":{
      "title":"Photo Cutter",
      "usedTech":["html","sass","js"],
      "descriptionText":"Photo Cutter is a tool I developed for personal use. It allows you to effortlessly crop your photos into a circular shape without compromising their quality. With just a few buttons and a resizing range, you can easily adjust the size of the circular crop to achieve the desired composition."
    }
  },
  {
    "url":"https://angular-reddit-liart-two.vercel.app//",
    "description":{
      "title":"Angular Reddit",
      "usedTech":["angular","sass"],
      "descriptionText":"Angular Reddit is a responsive web application that allows the user to post an article (with a title and a URL) and then vote on the posts. This project is part of a series of practical exercises and projects undertaken during my self-educating through the study of Nate Murray's ng-book - The Complete Guide to Angular 2020."
    }
  },
  {
    "url":"https://satanasova.github.io/UD-Ideogen/",
    "description":{
      "title":"UD Ideogen",
      "usedTech":["html","sass","bootstrap","jquery"],
      "descriptionText":"UD Ideogen is a responsive web application developed during my internship at Innovator Varna, showcasing an innovative and visually stunning user interface."
    }
  },
  {
    "url":"https://satanasova.github.io/UD-drag-n-drop/",
    "description":{
      "title":"UD Drag & Drop",
      "usedTech":["html","sass","jquery"],
      "descriptionText":"UD Drag & Drop is a small responsive web application developed during my internship at Innovator Varna. This project allows users to effortlessly create and organize navigation tabs by providing a user-friendly interface for adding titles and URLs. With the ability to intuitively reorder tabs using drag and drop functionality, users can easily customize the navigation structure according to their preferences. Additionally, the app offers the convenience of nesting tabs, enabling users to create hierarchical navigation menus for enhanced organization."
    }
  },
  {
    "url":"https://satanasova.github.io/Decoracion-Azul/",
    "description":{
      "title":"Decoracion Azul",
      "usedTech":["html","sass","js"],
      "descriptionText":"Decoracion Azul is an internship project from Innovator Varna. A simple responsive blog page with articles, filterable by topic and one internal article page."
    }
  },
  {
    "url":"https://satanasova.github.io/TC-Page-Task/",
    "description":{
      "title":"Modus Versus",
      "usedTech":["html","sass","js"],
      "descriptionText":"Modus Versus is a simple web page that incorporates sliders, accordions, and tabs. The project demonstrates my skills in creating responsive and grid-based layouts, as well as implementing intuitive and interactive components for an enhanced user experience"
    }
  },
  {
    "url":"https://satanasova.github.io/TC-Page-Task-2/",
    "description":{
      "title":"Design Contest",
      "usedTech":["html","sass","js"],
      "descriptionText":"Design Contest is a simple web page featuring counters and sliders. The counters dynamically display and animate numerical values, allowing users to track and visualize various metrics. "
    },
    "responsive": "false"
  },
  {
    "url":"https://satanasova.github.io/AA-Page-Task/",
    "description":{
      "title":"Best Apps",
      "usedTech":["html","bootstrap","sass"],
      "descriptionText":"Best Apps is a simple responsive web page. It features two automatic sliders and a contact form. The sliders automatically display different images or content, providing a visually appealing and dynamic experience for users."
    }
  },
  {
    "url":"https://satanasova.github.io/AA-JS-Task/",
    "description":{
      "title":"AA JS Task",
      "usedTech":["html","sass","js"],
      "descriptionText":"AA JS Task is a small responsive project, that includes a to-do list feature, allowing users to create and manage their tasks. Users can mark tasks as done and delete them for efficient task management. Additionally, there is a shopping cart feature with three products, enabling users to change the quantity and automatically calculate the total amount. Furthermore, the project incorporates two interactive quizzes that provide a final result based on the user's answers to all the questions. "
    }
  }
  
]